---
title: IntersectionResult
classe: Autodesk.Revit.DB.IntersectionResult
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# IntersectionResult

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Distance { get; set; }` | `intersectionResult.Distance` | Double |
| `Edge EdgeObject { get; set; }` | `intersectionResult.EdgeObject` | Edge |
| `Double EdgeParameter { get; set; }` | `intersectionResult.EdgeParameter` | Double |
| `Double Parameter { get; set; }` | `intersectionResult.Parameter` | Double |
| `UV UVPoint { get; set; }` | `intersectionResult.UVPoint` | UV |
| `XYZ XYZPoint { get; set; }` | `intersectionResult.XYZPoint` | XYZ |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```